#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьНаСервере(ДГантаОтпусков);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьНаСервере(ДанныеГрафика)
	ДанныеГрафика.Обновление = ложь;
	ДанныеГрафика.Очистить();
	
	ЗаполнитьДанныеГрафикаОтпусков(ДанныеГрафика);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеГрафикаОтпусков(ДГантаОтпусков)
	
	Пусто = Ложь;
	Если ЗначениеЗаполнено(Параметры.АдресВХ) Тогда
		АдресВХ = Параметры.АдресВХ;
		ДанныеГрафика = ПолучитьИзВременногоХранилища(АдресВХ);
		Серия = ДГантаОтпусков.УстановитьСерию("Отпуска");
	Иначе Пусто = Истина;
	КонецЕсли;
	Если НЕ Пусто Тогда
		Для Каждого Запись Из ДанныеГрафика Цикл
			Сотрудник = Запись.Сотрудник;
			ДатаНачала = Запись.ДатаНачала;
			ДатаОкончания = Запись.ДатаОкончания;
			Точка = ДГантаОтпусков.УстановитьТочку(Сотрудник);
			Значение = ДГантаОтпусков.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = ДатаНачала;
			Интервал.Конец = ДатаОкончания;
		КонецЦикла;                    
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


