
#Область СлужебныеПроцедурыИФункции
Процедура ОтправкаСообщенийВТелеграмБота() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СообщениеОтправлено = ОтправкаСообщенияВТелеграм(ВыборкаДетальныеЗаписи.ТекстСообщения);
		Если СообщениеОтправлено Тогда
			Уведомление = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Уведомление.Удалить(); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправкаСообщенияВТелеграм(ТекстСообщения) //Экспорт
	//https://api.telegram.org/bot<Bot_token>/sendMessage?chat_id=<chat_id>&text=Привет%20мир
	
	АдресСервера = "api.telegram.org";
	ИДЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	Метод = "sendMessage";
	Токен = "bot"+Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	
	//создайте защищённое соединение с сервером "api.telegram.org"
	ЗащищенноеСоендинение = Новый ЗащищенноеСоединениеOpenSSL;
	СоединениеНТТР = Новый HTTPСоединение(АдресСервера,,,,,,ЗащищенноеСоендинение);
	
	//создайте HTTP-запрос к ресурсу /bot[ВашТокен]/sendMessage
	//ОШИБКА Ресурс = АдресСервера+"/"+Токен+"/sendMessage";
	Ресурс = Токен+"/"+Метод;
	ЗапросHTTPPost = Новый HTTPЗапрос(Ресурс);
	
	//добавьте заголовок "Content-Type" со значением "application/json"
	ЗапросHTTPPost.Заголовки.Вставить("Content-Type", "application/json");
	
	//подготовьте структуру с полями:
	//"chat_id" - идентификатор группы из константы,
	//"text" - текст сообщения
	СообщениеВЧат = Новый Структура;
	СообщениеВЧат.Вставить("chat_id", ИДЧата);
	СообщениеВЧат.Вставить("text", ТекстСообщения);
	
	//установите JSON строку, полученную из структуры, в качестве тела HTTP-запроса
	Запись = Новый ЗаписьJSON; 
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,СообщениеВЧат);
	СтрокаJSON = Запись.Закрыть();
	ЗапросHTTPPost.УстановитьТелоИзСтроки(СтрокаJSON);
	
	//отправьте запрос с помощью метода "POST"
	Попытка
		Ответ = СоединениеНТТР.Получить(ЗапросHTTPPost);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	//проверьте, что получет ответ с кодом состояния 200, если код состояния отличный от 200, получите тело ответа как строку и запишите в журнал регистрации информацию об ошибке.
	ТекстОтветаPost = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("Отправка сообщения в телеграм",
		УровеньЖурналаРегистрации.Ошибка,,,ТекстОтветаPost);
		Результат = Ложь; 
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции
#КонецОбласти
