#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ГруппаЭлементовАбонентскогоОбслуживания = Элементы.Добавить("ГруппаЭлементовАбонентскогоОбслуживания", Тип("ГруппаФормы") );
	ГруппаЭлементовАбонентскогоОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЭлементовАбонентскогоОбслуживания.ОтображатьЗаголовок = Ложь;
	ГруппаЭлементовАбонентскогоОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ВКМ_ДобавитьРеквизитыНаФорму();
	ВКМ_УстановитьВидимостьДобавленныхЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_УстановитьВидимостьДобавленныхЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьРеквизитыНаФорму()
	
	ГруппаДействиеДоговора = Элементы.Добавить("ГруппаДействиеДоговора", Тип("ГруппаФормы"), Элементы.ГруппаЭлементовАбонентскогоОбслуживания);
	ГруппаДействиеДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДействиеДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаДействиеДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	ЭлементДатаДействияС = Элементы.Добавить("ДатаДействияС", Тип("ПолеФормы"), ГруппаДействиеДоговора);
	ЭлементДатаДействияС.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаДействияС.ПутьКДанным = "Объект.ВКМ_ДатаДействияС";
	
	ЭлементДатаДействияПО = Элементы.Добавить("ДатаДействияПО", Тип("ПолеФормы"), ГруппаДействиеДоговора );
	ЭлементДатаДействияПО.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаДействияПО.ПутьКДанным = "Объект.ВКМ_ДатаДействияПо";
	
	ГруппаУсловийДоговора = Элементы.Добавить("ГруппаУсловийДоговора", Тип("ГруппаФормы"), Элементы.ГруппаЭлементовАбонентскогоОбслуживания);
	ГруппаУсловийДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУсловийДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаУсловийДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаУсловийДоговора);
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ЭлементСоимостьЧасаРабот = Элементы.Добавить("СоимостьЧасаРабот", Тип("ПолеФормы"), ГруппаУсловийДоговора);
	ЭлементСоимостьЧасаРабот.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСоимостьЧасаРабот.ПутьКДанным = "Объект.ВКМ_СоимостьЧасаРабот";

КонецПроцедуры

&НаСервере
Процедура ВКМ_УстановитьВидимостьДобавленныхЭлементов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	Элементы.ГруппаЭлементовАбонентскогоОбслуживания.Видимость = Истина;
	Иначе
	Элементы.ГруппаЭлементовАбонентскогоОбслуживания.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


