
#Область ОбработчикиСобытий   
#Если НаСервере Тогда 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СформироватьЗарплатуКВыплате();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 
#КонецЕсли
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 
#Если НаСервере Тогда
	
Процедура СформироватьЗарплатуКВыплате()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ДополнительныеНачисления.Сторно КАК Сторно,
	|	ВЫБОР
	|		КОГДА ВКМ_ДополнительныеНачисления.Сторно = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Сумма, 0) * -1
	|		ИНАЧЕ ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Сумма, 0)
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВКМ_ДополнительныеНачисления.Сторно = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВКМ_ДополнительныеНачисления.СуммаНДФЛ, 0) * -1
	|		ИНАЧЕ ЕСТЬNULL(ВКМ_ДополнительныеНачисления.СуммаНДФЛ, 0)
	|	КОНЕЦ КАК СуммаНДФЛ,
	|	ВКМ_ДополнительныеНачисления.База КАК База
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Пока Выборка.Следующий() Цикл //НомерСтроки, Сотрудник, ВидРасчета, КонецЦикла;
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьПоТекущимОстаткамНаСервере(Объект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Объект.Выплаты.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.Выплаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	КонецЦикла;
	
	
КонецПроцедуры
#КонецЕсли	

#КонецОбласти

