
#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ЗаполнитьПоТекущимОстаткам(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		КомандаЗаполнитьПоТекущимОстаткамНаСервере();   
	Иначе
		СообщениеП = Новый СообщениеПользователю;
		СообщениеП.Текст = "Необходимо записать документ.";
		СообщениеП.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура КомандаЗаполнитьПоТекущимОстаткамНаСервере() 
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьПоТекущимОстаткамНаСервере(Объект);
	
КонецПроцедуры
#КонецОбласти

